---
kind: property
id: P:Autodesk.Revit.DB.View.CanBePrinted
zh: 视图
source: html/471c406a-2781-5832-e567-d490c23e32ad.htm
---
# Autodesk.Revit.DB.View.CanBePrinted Property

**中文**: 视图

Test whether the view can be printed.

## Syntax (C#)
```csharp
public bool CanBePrinted { get; }
```